# WireSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSet Constructor
WireSet Class See Also
---
Initializes a new instance of the WireSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireSet()
```

# See Also
WireSet Class
Autodesk.Revit.DB.Electrical Namespace